Revit 2027 API
ScheduleFilter.FilterType Property
 The filter type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ScheduleFilterType FilterType { get; set; }
Public Property FilterType As ScheduleFilterType
	Get
	Set
public:
property ScheduleFilterType FilterType {
	ScheduleFilterType get ();
	void set (ScheduleFilterType value);
}
member FilterType : ScheduleFilterType with get, set
Property Value
ScheduleFilterType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
 See ScheduleFilterType for details.
See Also
Reference
ScheduleFilter Class
Autodesk.Revit.DB Namespace